Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་ཡུལ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ལ་ཡེ་ཤེས་ཀྱི་མྱིག་ཤིན་ཏུ་རྣམ་པར་དག་པ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ལ་ཞུགས་པ།
en: In the same way, the bodhisattvas had the pure vision of wisdom concerning the inconceivable range of the Tathāgata, and they perceived the inconceivable range of the wisdom of the Tathāgata.

source: དེ་དག་ཛེ་ཏའི་ཚལ་ན་འཁོད་ཅིང་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དེ་དག་མཐོང་ལ་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་ཅིང་ཏིང་ངེ་འཛིན་གྱི་ཕྱག་རྒྱ་ཡོངས་སུ་སྒྲུབ་སྟེ། དེ་བཞིན་གཤེགས་པའི་མཆོད་པ་དང་། རིམ་གྲོ་ལ་བརྩོན་ཞིང་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་ལ་མངོན་པར་བརྩོན་ཏེ། བསྡུ་བའི་དངོས་པོ་བཞིས་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྡུད་ཀྱང་།
en: They were present in Jetavana and saw the miracles of the Buddha, perceived an ocean of the ways of the Dharma, had applied the seal of samādhi, were engaged in making offerings to the Tathāgata, were dedicated to possessing the Dharma, and gathered beings through the four methods of gathering pupils.

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་ཀུན་ནས་འདུས་པ་དེ་ལྟ་བུའང་མ་མཐོང་མ་ཤེས་སོ། །
en: The great śrāvakas did not see those miracles of the Tathāgata or that gathering of the great assembly of bodhisattvas.

source: འདི་ལྟ་སྟེ་དཔེར་ན། སྐྱེས་བུ་ལ་ལ་ཞིག་མྱིག་གཉིས་གོས་ཀྱིས་བཀབ་སྟེ། རིན་པོ་ཆེའི་གླིང་དུ་ཕྱིན་པར་གྱུར་ན།
en: By analogy, a man who is blindfolded arrives at an island of jewels.

source: དེས་རིན་པོ་ཆེའི་གླིང་དེར་ཕན་ཚུན་འགྲོ་བ་དང་། འགྲེང་བ་དང་འདུག་པ་དང་ཉལ་བ་བྱས་ཀྱང་རིན་པོ་ཆེའི་འབྱུང་གནས་དེ་མྱི་མཐོང་ངོ་། །
en: He walks around that island of jewels, stands on it, sits on it, and lies down on it, but he does not see that source of jewels.

source: རིན་པོ་ཆེའི་ཤིང་དང་གོས་ཀྱི་རིན་པོ་ཆེ་དང་། སྤོས་ཀྱི་རིན་པོ་ཆེ་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱང་མྱི་མཐོང་ལ།
en: He does not see the trees of jewels, the clothing of jewels, the incense of jewels, or all the jewels.

source: རིན་པོ་ཆེ་དེ་དག་གི་སྤྱོད་ཡུལ་ལམ། རིན་ཐང་ངམ། ཡོངས་སུ་སྤྱོད་པའི་རྒྱུས་ཀྱང་མི་ཤེས་པས།
en: He does not know the scope, the value, or the use of those jewels.

source: དེ་ནི་རིན་པོ་ཆེ་དེ་དག་ལེན་ཀྱང་མྱི་ལེན་ལ།
en: He does not acquire the jewels.

source: རིན་པོ་ཆེའི་དོན་ཀྱང་ཉམས་སུ་མྱོང་པར་མྱི་བྱེད་དོ། །
en: He does not understand what could be done with the jewels.

source: གང་གི་མྱིག་ལ་བསྒྲིབས་པ་མེད་པ་དེ་དག་གིས་ནི་དེ་དག་ཐམས་ཅད་མཐོང་ཞིང་ཤེས་སོ། །
en: Those who are not blindfolded see and know all those jewels.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་རིན་པོ་ཆེའི་གླིང་ཆེན་པོར་ཕྱིན་པ་དེ་དག་གིས་བླ་ན་མེད་པའི་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་རྒྱན་དུ་གྱུར་པ་མངོན་དུ་གྱུར་ཏེ།
en: In the same way, the bodhisattvas had reached the island of the jewels of the Dharma and saw before them the supreme jewel of the Tathāgata, the adornment of the entire world, present in Jetavana and demonstrating the inconceivable miracles of a buddha.

source: ཛེ་ཏའི་ཚལ་ན་བཞུགས་ཤིང་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མྱི་ཁྱབ་པ་ཡོངས་སུ་སྟོན་པ་མཐོང་ཡང་ཉན་ཐོས་ཆེན་པོ་དེ་དག །དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་དེ་ཉིད་ན་གནས་ཤིང་སྤྱོད་ཀྱང་། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་རྣམ་པར་འཕྲུལ་པའི་ཆོ་འཕྲུལ་དེ་དག་མ་མཐོང་ངོ་། །
en: The great śrāvakas were present, staying at the feet of the Tathāgata, but did not see manifested miracles from the range of the Tathāgata’s samādhi.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་མང་པོ་དེ་ལྟ་བུའི་རིན་པོ་ཆེའི་འབྱུང་གནས་ཆེན་པོ་ཡང་མཐོང་བར་མ་གྱུར་ཏོ། །
en: They did not see the great assembly of the bodhisattvas who were like a source of jewels.

source: དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་གྱི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། ཆོ་འཕྲུལ་བསམ་གྱིས་མྱི་ཁྱབ་པ་དེ་དག་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མི་མཐུན་པའི་ཕྱོགས་ཀྱི་མ་རིག་པའི་གོས་ཀྱིས་ཡེ་ཤེས་ཀྱི་མིག་བཀབ་པ།
en: Because their eyes of wisdom were blindfolded by the ignorance that is contrary to omniscience.

source: དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་མིག་ཡོངས་སུ་དག་པ་དེ་ལྟ་བུ་མེད་དོ། །དེ་དག་གིས་ཆོས་ཀྱི་དབྱིངས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལ་འཇུག་པ་དེ་ལྟ་བུ་ཁོང་དུ་མ་ཆུད་དོ། །
en: They did not have the purified eyes of wisdom of the bodhisattvas, and they had not realized the comprehension of the lineage of the Dharma’s domain, through which one could see the inconceivable manifestation of miracles from the supremacy of the Tathāgata’s samādhi.

source: འདི་ལྟ་སྟེ་དཔེར་ན། མྱིག་ཡོངས་སུ་དག་པ་རྡུལ་དང་བྲལ་བས་རབ་ཏུ་སྣང་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་རབ་རིབ་དང་།
en: By analogy, there is the completely purified sight called stainless brilliance, which does not experience any darkness.

source: མུན་པ་ཐམས་ཅད་དང་མི་འགྲོགས་པ་ཡོད་དེ། དེ་མྱི་ལ་ལ་ཞིག་གིས་ཐོབ་པར་གྱུར་ན། དེ་རྡུལ་དང་བྲལ་བས་རབ་ཏུ་སྣང་བ་དང་ལྡན་པའི་མིག་ཡོངས་སུ་དག་པ་དང་ལྡན་པས་མཚན་མོ་མུན་པའི་མུན་ནག་ཤིན་ཏུ་གནག་པར་གྱུར་པའི་ནང་ན་སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཀུན་ནས་འདུས་པ་དང་། ཆོ་ག་དང་སྤྱོད་ལམ་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་ཞིང་མུན་པའི་རབ་རིབ་ཀྱིས་མྱིག་ཡོངས་སུ་འཁྲུགས་པར་གྱུར་པ་མྱིའི་ཁྲོད་ན་འདུག་ཅིང་རྣམ་པར་རྒྱུ་ལ་ཕན་ཚུན་འགྲོ་བ་དང་། འགྲེང་བ་དང་སྤྱོད་ལམ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་སྤྱོད་ཀྱང་མི་དེ་དག་གིས་སྐྱེས་བུ་སྤྱོད་ལམ་སྣ་ཚོགས་ཀྱི་སྤྱོད་པ་དེ་མི་མཐོང་མྱི་ཤེས་སོ། །
en: If a man who has obtained that purified sight named stainless brilliance were to go in the completely black darkness of a dark night among a gathering of a quintillion people who have various practices and conduct and whose sight is overwhelmed by darkness, he would move, stand, sit down, and act among them in various ways, but those people will not see or know of that man’s various kinds of activity.

source: སྐྱེས་བུ་དེས་ནི་འགྲོ་བའི་ཚོགས་ཆེན་པོ་སྤྱོད་ལམ་དང་ཆོ་ག་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་སྤྱོད་པ། ཕྱོགས་ཐ་དད་དུ་མངོན་པར་བལྟས་པ། དབྱིབས་ཀྱི་རྣམ་པ་ཐ་དད་པ་ཁ་དོག་གི་རྣམ་པ་ཐ་དད་པ་དམིགས་པའི་ཚུལ་ཐ་དད་པ་ཐམས་ཅད་ཀྱང་མི་མཐོང་བ་མེད་དོ། །
en: However, when that man looks in the different directions at the various practices and conduct that the great gathering of beings is performing, he sees their various shapes, their various colors, with none of those various sights unseen.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱི་འཁོར་མངའ་བ། རྣམ་པར་དག་ཅིང་ཆགས་པ་མི་མངའ་བའི་སྤྱན་དང་ལྡན་པས་འཇིག་རྟེན་ཐམས་ཅད་མཁྱེན་ཅིང་གཟིགས་ཏེ།
en: In the same way, the Tathāgata, who has an entourage of an assembly of bodhisattvas, possesses the sight that is pure and unimpeded so that he sees and knows the entire world.

source: སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་དང་ཆོ་འཕྲུལ་ཆེན་པོ་བསྟན་པ་མཛད་ཀྱང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དང་ཏིང་ངེ་འཛིན་གྱིས་རྣམ་པར་སྤྲུལ་པའི་ཆོ་འཕྲུལ་ཆེན་པོ་དེ་དག་མཐོང་བར་མ་གྱུར་ཏོ། །
en: He demonstrates the manifestation of the great miracles of a buddha’s samādhi, but the great śrāvakas do not see those great miracles manifested by the samādhi and wisdom of the Tathāgata.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་ཚོགས་ཆེན་པོ་དེ་ལྟ་བུ་ཡང་མཐོང་བར་མ་གྱུར་ཏོ། །འདི་ལྟ་སྟེ་དཔེར་ན།
en: Nor do they see that great assembly of the great bodhisattvas.

source: དགེ་སློང་ལ་ལ་ཞིག་སྐྱེ་བོ་མང་པོའི་ཚོགས་ཀྱི་དབུས་སུ་སས་ཁྱབ་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་འམ། ཆུས་ཁྱབ་པའམ། མེས་ཁྱབ་པ་འམ། རླུང་གིས་ཁྱབ་པ་འམ། སྔོན་པོས་ཁྱབ་པའམ། སར་པོས་ཁྱབ་པ་འམ། དམར་པོས་ཁྱབ་པ་འམ། དཀར་པོས་ཁྱབ་པ་འམ། ལྷས་ཁྱབ་པ་འམ།
en: By analogy, it is like when a bhikṣu in the center of an assembly of many beings rests in the samādhi of the pervasion of earth or rests in the samādhi pervaded by water or the samādhi pervaded by fire, pervaded by air, pervaded by blue, pervaded by yellow, pervaded by red, pervaded by white, pervaded by devas, pervaded by the bodies of various beings, pervaded by all sounds and voices, or pervaded by all perceptions.

source: སེམས་ཅན་སྣ་ཚོགས་ཀྱི་ལུས་ཀྱིས་ཁྱབ་པ་འམ། སྒྲ་དང་དབྱངས་ཀུན་གྱིས་ཁྱབ་པ་འམ། དམིགས་པ་ཐམས་ཅད་ཀྱིས་ཁྱབ་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ན་འགྲོ་བ་མང་པོའི་ཚོགས་དེ་དག་གིས་ཆུའི་ཕུང་པོ་དེ་མི་མཐོང་ངོ་། །མེའི་སྣང་བ་དེ་ཡང་མི་མཐོང་ངོ་། །སེམས་ཅན་སྣ་ཚོགས་ཀྱི་ལུས་ཀྱིས་ཁྱབ་པ་དང་།
en: That assembly of many beings does not see a mass of water, does not see the light of fire, does not see the pervasion by the bodies of various beings, and so on up to not seeing the pervasion by all perceptions.

source: དམིགས་པ་ཐམས་ཅད་ཀྱིས་ཁྱབ་པའི་བར་དུ་ཡང་མི་མཐོང་སྟེ། ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་ཤིང་རྣམ་པར་སྤྱོད་པ་རྣམས་ནི་མ་གཏོགས་སོ། །
en: It only sees him practicing and resting in the samādhis.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་གྱི་རྣམ་པར་སྤྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་དེ་དག་ཡོངས་སུ་བསྟན་པ་མཛད་ན་ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་མཐོང་ཞིང་ཤེས་པར་མ་གྱུར་ཏེ།
en: In the same way, when the Tathāgata manifests inconceivable miracles that are the range of a buddha’s samādhi, the great śrāvakas do not see or know them.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་ལམ་ལ་ཞུགས་པ་དེ་དག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་ཡུལ་དེ་དག་མཐོང་ངོ་། །ཁོང་དུ་ཆུད་དོ། །
en: The bodhisattvas who are following the path of the tathāgatas see and comprehend that range of activity of the tathāgatas.

source: འདི་ལྟ་སྟེ་དཔེར་ན། བསྐུ་བ་གྲུབ་པའི་མྱི་ནི་མིག་གཉིས་བསྐུས་མ་ཐག་ཏུ། སྐྱེ་བོ་མང་པོ་ཐམས་ཅད་ཀྱིས་ལུས་མི་མཐོང་ངོ་། །
en: For example, as soon as a man who creates ointments smears it on his two eyes, an entire multitude of beings cannot see his body, but he can see the bodies of the entire multitude of beings.

source: དེས་ནི་འགྲོ་འམ་འདུག་གམ། འགྲེང་ཡང་རུང་སྟེ། འགྲོ་བ་མང་པོ་ཐམས་ཅད་མཐོང་ངོ་། །
en: Whether he is walking, sitting, or standing, he sees the entire multitude of beings.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་ལས་འདས་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཡུལ་ལས་ཡོངས་སུ་འདས་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་དུ་བཞུགས་པ།
en: In that same way, the Tathāgata has transcended the world, has passed beyond the range of perception of all beings, and has attained the range of omniscient wisdom but can be perceived by the vision of the wisdom of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་མིག་གིས་ཤེས་པར་བྱ་བ་དེས་འགྲོ་བ་ཐམས་ཅད་གཟིགས་ཀྱང་ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་དེ་དག་མ་མཐོང་ངོ་། །
en: He can see all beings, but the great śrāvakas do not see the miracle of the Tathāgata.

source: འདི་ལྟ་སྟེ་དཔེར་ན། མྱིའི་ཚེར་འགྲོགས་པའི་ལྷ་རྟག་ཏུ་རྗེས་སུ་འབྲང་བ་ནི།
en: For example, a deity who accompanies a human for his entire life is always following him.

source: དེས་མྱི་དེ་མཐོང་ཡང་མྱིས་ལྷ་དེ་མི་མཐོང་ངོ་། །
en: The deity sees the human, but the human does not see the deity.

source: དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་ཞུགས་པ། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀུན་ནས་འདུས་པ་ཆེན་པོའི་དབུས་སུ་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་ཡོངས་སུ་བསྟན་པ་མཛད་ཀྱང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་ཆེན་པོ་དང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱི་རྣམ་པར་འཕྲུལ་པ་དེ་དག་ཀྱང་མ་མཐོང་ངོ་། །མ་ཤེས་སོ། །
en: In the same way, the Tathāgata has attained the range of perception of the wisdom of omniscience, and he manifests miracles in the middle of the great gathering of the assembly of bodhisattvas, but the great śrāvakas do not see and do not know of the Tathāgata’s great manifestation of miracles or the miracle of the assembled circle of bodhisattvas.

source: འདི་ལྟ་སྟེ་དཔེར་ན། དགེ་སློང་སེམས་ཅན་ཐམས་ཅད་ལ་དབང་གི་དམ་པའི་ཕ་རོལ་ཏུ་བགྲོད་པར་ཕྱིན་པའི་མཆོག་ཐོབ་པ་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་ལ་སྙོམས་པར་ཞུགས་པ་ནི་ཤེས་པ་མེད་ལ་ཚོར་བ་མེད་པས་དབང་པོ་དྲུག་གིས་ཀྱང་བྱ་བ་གང་ཡང་ཉམས་སུ་མི་མྱོང་སྟེ།
en: Consider, for example, a bhikṣu who has reached the perfection of power over his entire mind and rests in a meditation in which all perception and sensation has ceased. Through his being without perception or sensation, his six senses do not experience anything.

source: མྱ་ངན་ལས་འདས་པའང་མ་ཡིན་ལ་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཐམས་ཅད་གནས་དེ་ཡོད་ཀྱང་སྙོམས་པར་ཞུགས་པ་དེ་ཉིད་ཀྱི་བྱིན་གྱི་རླབས་དང་མཐུས་དེས་མི་ཤེས་མྱི་མཐོང་ངོ་། །
en: He has not attained nirvāṇa, and worldly events are continuing and present, but through the power and might of being in that meditation, he does not perceive them and does not see them.

source: དེ་བཞིན་དུ་ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཛེ་ཏའི་ཚལ་དེ་ནའང་རྣམ་པར་སྤྱོད་ལ་དེ་དག་ལ་དབང་པོ་དྲུག་ཀྱང་ཡོད་དེ། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་འཕྲུལ་པ་དང་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། ཆོ་འཕྲུལ་དེ་དག་མཐོང་བར་མ་གྱུར། ཁོང་དུ་ཆུད་པར་མ་གྱུར་ཤེས་པར་མ་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་ཆོ་འཕྲུལ་ཆེན་པོ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་དེ་དག་ཀྱང་ཁོང་དུ་མ་ཆུད་མ་མཐོང་མ་ཤེས་སོ། །
en: In the same way, the great śrāvakas were present in Jetavana, and they had all the six sensory faculties, but they did not see, did not perceive, and did not know of the manifestation of miracles and supremacy from the samādhi of the Tathāgata.

source: སངས་རྒྱས་ཀྱི་ཡུལ་ནི་ཟབ་ཅིང་ཡངས་ལ་ཚད་མེད་དེ། བལྟ་བར་དཀའ་ཞིང་རྟོགས་པར་དཀའ་སྟེ། ཁོང་དུ་ཆུད་པར་དཀའ་ལ་འཇིག་རྟེན་ཐམས་ཅད་ལས་ཡོངས་སུ་འདས་པའོ། །
en: The range of activity of the Buddha is profound, vast, immeasurable, difficult to see, and difficult to understand.

source: སངས་རྒྱས་ཀྱི་ཡུལ་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་མི་འདུས་པའོ། །
en: The Buddha’s range of activity is inconceivable and is inaccessible to the śrāvakas and pratyeka­buddhas.

source: དེ་བས་ན་ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཛེ་ཏའི་ཚལ་དེ་ཉིད་ན་འཁོད་ཅིང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་སྤྱོད་ཀྱང་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དེ་དག་དང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དེ་དག་ཀྱང་མ་མཐོང་ངོ་། །
en: Therefore, the great śrāvakas were assembled in Jetavana and were present at the feet of the Bhagavat, but they did not see the Buddha’s miracles or the great gathering of bodhisattvas.

source: ཛེ་ཏའི་ཚལ་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་པ་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམ་པར་དག་པའི་ཡོན་ཏན་དང་། རྒྱན་ཡོངས་སུ་འདུས་པ་དེ་དག་ཀྱང་མ་མཐོང་མ་ཤེས་ཏེ། དེ་ནི་སྣོད་དུ་མ་གྱུར་པའི་ཕྱིར་རོ། །
en: They also did not see or perceive the accumulation in Jetavana of the qualities and adornments of countless, innumerable pure world realms, because they were not worthy of it.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་མཛད་ཀྱི་སྨོན་ལམ་གྱི་གཙུག་གི་འོད་ཟེར་རབ་ཏུ་སྣང་བས་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ལྟོས་ཤིག་སེམས་ཅན་དམ་པ་ཡི། །སངས་རྒྱས་བྱང་ཆུབ་བསམ་མྱི་ཁྱབ། །
en: At that time, the bodhisattva Vairocana­praṇidhāna­nābhi­raśmi­prabha recited these verses: “See the inconceivable enlightenment, The buddhahood of the supreme being!

source: རྒྱལ་བས་སངས་རྒྱས་རྣམ་འཕྲུལ་བ། ཛེ་ཏའི་རྒྱལ་མཚན་འདིར་བསྟན་ཏོ། །རང་བྱུང་རྣམས་ཀྱི་བྱིན་གྱི་རླབས། །
en: The Jina has manifested the miracles Of a buddha in this Jetadhvaja.

source: བགྲང་དུ་མེད་པར་འབྱུང་བ་ལ། །སངས་རྒྱས་ཆོས་ཚུལ་མི་ཤེས་པའི། །འཇིག་རྟེན་ཀུན་ཀྱང་མགོ་རྨོངས་སོ། །
en: {1} “There appears the self-arising, Incalculable power of transformation That the world, not knowing the way Of the Dharma, is ignorant of.

source: ཆོས་ཀྱི་རྒྱལ་པོའི་ཆོ་འཕྲུལ་དག །ཚད་མེད་བསམ་གྱིས་མི་ཁྱབ་ཅིང་། །ཤིན་ཏུ་ཟབ་པ་འབྱུང་བ་ནི། །དེ་ལ་འཇིག་རྟེན་འབབ་མི་ནུས།
en: {2} “There are the profound, Immeasurable, inconceivable Miracles of the Dharma kings That the world does not fathom.

source: རྫོགས་པའི་སངས་རྒྱས་ཁ་དོག་མདོག །མཚན་གྱིས་ཤིན་ཏུ་རྣམ་པར་ཀླུབས། །
en: {3} “The buddhas have infinite splendor And are adorned by characteristics.

source: ཡང་དག་སངས་རྒྱས་བསྐྱེད་པ་ཡིས། ཆོས་རབ་དེ་དག་མཚན་ཉིད་མེད། །
en: The Dharmas that the buddhas produce Are without characteristics.

source: རྣམ་འཕྲུལ་མཐའ་དང་དབུས་མྱེད་ལ། །ཚིག་གི་ལམ་གྱིས་བརྗོད་དཀའ་བའི། །རྣམ་འཕྲུལ་ཤིན་ཏུ་ཟབ་པ་དག །རྒྱལ་བས་ཛེ་ཏའི་ཚལ་དུ་བསྟན། །
en: {4} “In the grove that is named Jeta The Jina demonstrates miracles That are without center or edge And difficult to describe in words.

source: རྒྱལ་སྲས་བདག་ཉིད་ཆེ་བའི་རྣམས། །ཞིང་རྣམས་བསམ་ཡས་བྱེ་བ་ནས། །རྒྱལ་བའི་ཞལ་ལྟར་མོས་དགའ་སྟེ། །ཀུན་ནས་འདུས་པའི་ཚོགས་ལ་ལྟོས། །
en: {5} “See the assembly of great beings, Of bodhisattvas, who have assembled From countless millions of realms Wishing to look upon the Jina.

source: སྨོན་ལམ་ཡོངས་སུ་ཕུན་སུམ་ཚོགས། །སྤྱོད་ལམ་སྤྱོད་པ་ཆགས་མེད་པ། །དེ་དག་བསམ་པ་ཤེས་པར་ནི། །འཇིག་རྟེན་ཀུན་གྱིས་མི་ནུས་སོ། །
en: {6} “The entire world is unable To know or think of that Fulfillment of prayers And that unimpeded conduct.

source: དེ་དག་སེམས་དང་སྤྱོད་ཡུལ་དང་། །སྤྱོད་པ་དག་ཀྱང་ཉན་ཐོས་དང་། །རང་རྒྱལ་ཐམས་ཅད་ཡོངས་ཀྱིས་ཀྱང་། །རྣམ་པ་ཀུན་ཏུ་ཤེས་མི་ནུས། །
en: {7} “The pratyeka­buddhas And the śrāvakas do not know Anything about their conduct Or the range of their minds.

source: རྒྱལ་སྲས་ཤེས་རབ་ཆེན་པོ་རྣམས། །གཞན་གྱིས་ཐུབ་དཀའ་ཕམ་བྱེད་ལ། །དཔའ་བའི་རྒྱལ་མཚན་མ་འདྲེས་ཤིང་། །ཡེ་ཤེས་ས་ལ་གཞོལ་གྱུར་པ། །
en: {8} “Those with great wisdom, the bodhisattvas, Are invincible and undefeatable, Banners of heroism, unadulterated, And they have reached the level of wisdom.

source: ཏིང་འཛིན་དཔག་ཏུ་ཚད་མེད་ལ། །གྲགས་ཆེན་མཉམ་པར་གཞག་པ་རྣམས། །
en: {9} “They have great renown And have attained immeasurable samādhis.

source: ཆོས་དབྱིངས་ཐམས་ཅད་རྒྱས་བཀང་ཞིང་། རྣམ་པར་འཕྲུལ་པ་ཀུན་ཀྱང་སྟོན། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཐུབ་པར་དཀའ་བའི་བརྩོན་འགྲུས་ཀྱི་ཤུགས་ཀྱི་རྒྱལ་པོས་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས།
en: They demonstrate miracles that pervade The entire domain of phenomena.”

source: ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ནས། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །བསོད་ནམས་སྙིང་པོ་ཤེས་རབ་ཆེ། །བྱང་ཆུབ་སྤྱོད་པའི་ཚུལ་རྟོགས་ཤིང་། །འཇིག་རྟེན་ཀུན་ལ་བདེ་བྱེད་པའི། །བདེ་གཤེགས་སྐུ་ལས་སྐྱེས་པ་ལྟོས། །
en: {10} Then the bodhisattva Duryodhana­vīrya­vega­rāja, through the blessing of the Buddha, looked into the ten directions and recited these verses: “See those who are born from the sugatas, They who bring happiness to the world, Who have the essence of merit, great wisdom, And who have realized the conduct of a bodhisattva.

source: ཡིད་གཞུངས་བློ་གྲོས་མཐའ་ཡས་ཤིང་། །
en: {11} “They are learned, with infinite knowledge.

source: ཤིན་ཏུ་མཉམ་གཞག་སེམས་ལྡན་པ། །
en: Their minds are in a perfect state of meditation.

source: མཐའ་དང་དབུས་མེད་ཟབ་པ་ཡི། །ཡེ་ཤེས་རྒྱ་ཆེན་སྤྱོད་ཡུལ་ཅན། །རྒྱན་རབ་མང་པོས་མཛེས་བྱས་པའི། །ཛེ་ཏའི་ནགས་ཚལ་རྒྱ་ཆེ་བ། །བྱང་ཆུབ་སེམས་དཔས་ཀུན་རྒྱས་ཤིང་། །
en: They have the range of a vast wisdom That is profound and without center or limit.

source: བདེ་གཤེགས་བཞུགས་པའི་གནས་གྱུར་པ། །གནས་མེད་མི་གནས་གྱུར་བ་རྣམས། །ཕྱོགས་རྣམས་བཅུ་ནས་ཀུན་འདུས་ཏེ། །པདྨོའི་སྟན་ལ་འཁོད་པ་དག །རྒྱ་མཚོ་མང་ལ་བལྟ་བགྱིས། །
en: {12} “See the numerous oceans Of they who have no dwelling, no basis, Who are assembled from the ten directions And seated upon lotus seats {13} “In the great forest named Jeta That is beautified by many adornments, That is completely filled with bodhisattvas And is the hermitage of the Sugata.

source: གནས་མྱེད་ལེན་པ་མེད་པ་རྣམས། །སྤྲོས་པ་མེད་ཅིང་མྱི་རྟེན་ལ། །རྡུལ་བྲལ་ཆགས་པའི་སེམས་མེད་པ། །ཆོས་ཀྱི་དབྱིངས་ལ་གཞོལ་བ་དང་། །
en: {14} “They are without basis, without acquisition, Without elaboration, without foundation, With unimpeded minds, stainless, Focused on the essence of phenomena.

source: ཡེ་ཤེས་རྒྱལ་མཚན་རབ་དཔའ་བ། །རྡོ་རྗེའི་སེམས་ནི་མི་གཡོ་ཞིང་། །
en: {15} “They are banners of wisdom, Great heroes who have vajra minds.

source: གྲུབ་པ་མེད་པའི་ཆོས་རྣམས་ལ། །མྱ་ངན་འདའ་བར་གང་སྟོན་པ། །
en: They are unshakable and teach nirvāṇa Within unceasing qualities.

source: ཕྱོགས་བཅུའི་ཞིང་མང་བྱེ་བ་རྣམས། །གྲངས་ཀྱིས་མྱི་ཆོད་ཀུན་ནས་འདུས། །ཡང་དག་སངས་རྒྱས་དྲུང་དུ་ལྷགས། གཉིས་ཀྱི་འདུ་ཤེས་རྣམ་པར་སྤངས། །
en: {16} “They have gathered from numerous millions Of realms beyond number in the ten directions And have arrived before the Buddha And are free from dualistic perception.

source: རང་འབྱུང་ཤཱཀྱ་སེང་གེ་ཡི། །རྣམ་པར་འཕྲུལ་པ་འདི་དག་མཐོང་། །དེ་ཡི་བྱིན་རླབས་དམ་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ལྷགས། །
en: {17} “They see these miracles Of the self-arisen Lion of the Śākyas, And it is through his blessing That these bodhisattvas have gathered.

source: སངས་རྒྱས་ཆོས་ལ་འབྱེད་པ་མེད། །ཆོས་དབྱིངས་གཞི་ལའང་དེ་བཞིན་ཏེ། །ཐ་སྙད་ཙམ་དུ་ཡོངས་འབྱེད་པའི། །ཕ་རོལ་ཕྱིན་པ་རྒྱལ་བའི་སྲས། །
en: {18} “The offspring of the jinas, they who have attained perfection, Do not distinguish between the Buddha’s Dharmas On the level of the essence of phenomena But make distinctions merely in terms of terminology.

source: ཆོས་ཀྱི་དབྱིངས་ལ་དབྱེར་མེད་པའི། །མཐའ་ལ་ཐུགས་པ་དེ་དག་གནས། །ཚིག་རྣམས་ཡོངས་སུ་ཟད་མེད་པས། ཆོས་ལ་དབྱེ་བའང་རབ་ཏུ་བྱེད།
en: {19} “They are established in the ultimate conclusion Of the indivisibility of the essence of phenomena, But they make distinctions between phenomena Through producing unceasing words.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ནས་འཕགས་པའི་གཟི་བརྗིད་རྒྱལ་པོས། །སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ཏེ། །དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ལྟོས་ཤིག་སེམས་ཅན་དམ་པ་ཡི། །ཡེ་ཤེས་དཀྱིལ་འཁོར་ཤིན་ཏུ་ཡངས། །
en: {20} Then the bodhisattva Samanta­śrī­samudgata­tejorāja, through the blessing of the Buddha, looked into the ten directions and recited these verses: “See the vast circle of wisdom Of the one who is supreme among beings.

source: དུས་དང་དུས་མྱིན་མཁྱེན་མཛད་ཅིང་། །སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱང་སྟོན། །
en: He knows when it is timely and untimely And then teaches the Dharma to beings.

source: མུ་སྟེགས་ལྡན་པ་ཚོགས་འདུས་པའི། །རྒོལ་བ་ཐམས་ཅད་རབ་ཏུ་འཇོམས། །
en: {21} “He completely defeats all opposition From gathered assemblies of tīrthikas.

source: སེམས་ཅན་བསམ་པ་ཇི་བཞིན་དུ། །རྣམ་པར་འཕྲུལ་བ་ཡོངས་སུ་སྟོན། །
en: He demonstrates miraculous acts According to the wishes of beings.

source: ཕྱོགས་ན་མི་བཞུགས་བདེ་གཤེགས་རྣམས། །སངས་རྒྱས་ཡུལ་གྱི་རྗེས་མི་བཞུད། །
en: {22} “The Sugata does not dwell in a direction; The Buddha does not go to a realm.

source: ཚད་མེད་པ་དང་ཚད་ཡོད་ལས། །ཐུབ་པ་ཆེན་པོ་འདས་པ་མྱིན། །
en: The great Muni is always both Ascertainable and unascertainable.

source: ཉི་མ་མཁའ་ལས་འགྲོ་བ་ནི། །ཉིན་པར་འགྲངས་པ་སྨོས་པ་བྱེད། །
en: {23} “The sun moving through the sky Demarcates the number of days.

source: དེ་བཞིན་མཁྱེན་པས་མཁས་སྟོན་པ། །དུས་གསུམ་ཆགས་པ་མེད་པས་བརྗོད། །
en: Thus the Teacher, wise with knowledge, Demarcates the three times without impediment.

source: ཟླ་བ་ཉ་བའི་མཚན་མོ་ལ། །ཟླ་བའི་དཀྱིལ་འཁོར་འཕགས་པར་སྣང་། །
en: {24} “On the night of a full moon The moon’s disk is the brightest light.

source: དེ་བཞིན་ཆོས་དཀར་ཡོངས་རྫོགས་པའི། །མགོན་པོ་རྣམས་ཀྱང་མཐོང་བ་ཡིན། །
en: In that way, the Lord Full of white Dharma is seen.

source: བར་སྣང་ནམ་མཁའི་དབྱིངས་འདི་ལས། །ཉི་མའི་དཀྱིལ་འཁོར་རྒྱུ་བ་ནི། །གར་ཡང་ཐོགས་པ་མེད་པར་འགྲོ། །སངས་རྒྱས་རྣམ་འཕྲུལ་དེ་བཞིན་ནོ། །
en: {25} “Just as the disk of the sun Moves through the sky Without being stopped— Thus are the Buddha’s miracles.

source: ཇི་ལྟར་ནམ་མཁའི་ཕྱོགས་རྣམས་ཀྱི། །ཞིང་རྣམས་ཀུན་ལ་མི་གནས་པ། །དེ་བཞིན་འཇིག་རྟེན་སྒྲོན་མ་ཡི། །སངས་རྒྱས་རྣམ་འཕྲུལ་ཤེས་པར་བྱ། །
en: {26} “Just as space is not dependent On the worlds in the directions, In that way, the buddha miracles Of the Lamp of the World are to be known.

source: ཇི་ལྟར་ས་ནི་འཇིག་རྟེན་ན། །ལུས་ཅན་ཀུན་གྱི་གནས་ཡིན་པ། འཇིག་རྟེན་སྒྲོན་མའི་འཇིག་རྟེན་ན། །ཆོས་ཀྱི་འཁོར་ལོ་དེ་ལྟར་གནས། །
en: {27} “Just as in the world the earth Is the support for all beings, In that way, in the world the Dharma wheel Of the Lamp of the World is a support.

source: ཇི་ལྟར་རླུང་ནི་ཆགས་མེད་པར། །མཁའ་ལས་མགྱོགས་པར་རབ་རྒྱུ་བ། །དེ་བཞིན་སངས་རྒྱས་ཆོས་ཉིད་ཀྱང་། །འཇིག་རྟེན་ཁམས་སུ་རབ་ཏུ་རྒྱུ། །
en: {28} “Just as the wind, without impediment, Moves swiftly through the sky, In that way, the Buddha’s nature Moves through the world realms.

source: ཇི་ལྟར་ཆུ་ཡི་ཕུང་པོ་ལ། །ཞིང་རྣམས་བགྲངས་པ་ཀུན་གནས་པ། །དེ་བཞིན་དུས་གསུམ་སངས་རྒྱས་ཀྱང་། །ཡེ་ཤེས་ཚོགས་ལ་རབ་ཏུ་གནས། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དཔལ་གྱི་སྙིང་པོ་ཆགས་པ་མེད་པའི་རྒྱལ་པོས།
en: {29} “Just as the numbers of worlds Are based on accumulations of water, In that way, the buddhas of the three times Are based on accumulations of wisdom.”

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ཏེ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ཇི་ལྟར་རྡོ་རྗེའི་རི་དང་བྲག །ཟང་ཡག་ཤིན་ཏུ་མཐོ་ཡོད་པ། །ད་ལྟར་འཇིག་རྟེན་ཀུན་སྐྱོབ་པའི། །
en: {30} Then the bodhisattva Asaṅga­śrī­garbha­rāja, through the blessing of the Buddha, looked into the ten directions and recited these verses: “Just like high mountains and cliffs That are made of vajras, The Buddha, the protector of all worlds, Is the highest in the world.

source: སངས་རྒྱས་མངོན་པར་འཕགས་པས་མཐོ། །ཇི་ལྟར་རྒྱ་མཚོའི་ཆུ་ཆེན་དག །ཚད་མེད་རྙོག་པ་མེད་པ་ལྟར། །སངས་རྒྱས་མཐོང་བའང་དེ་བཞིན་ཏེ། །འཇིག་རྟེན་ཀུན་གྱི་སྐོམ་པ་གཅོད། །
en: {31} “Just as the great water of the ocean Is immeasurable and unpolluted, In that way, the sight of the Buddha Dispels the thirst of the world.
